/*
snes.c - Super NES support for uCON64

written by 1999 - 2002 NoisyB (noisyb@gmx.net)
           2001 - 2003 dbjh
           2002 - 2003 John Weidman


This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 2 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program; if not, write to the Free Software
Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
*/
#ifdef  HAVE_CONFIG_H
#include "config.h"
#endif
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#ifdef  HAVE_UNISTD_H
#include <unistd.h>
#endif
#include "misc.h"
#include "quick_io.h"
#include "ucon64.h"
#include "ucon64_dat.h"
#include "ucon64_misc.h"
#include "snes.h"
#include "backup/mgd.h"
#include "backup/gd.h"
#include "backup/swc.h"
#include "backup/fig.h"


#define SNES_HEADER_LEN (sizeof (st_snes_header_t))
#define SNES_NAME_LEN 21
#define GD3_HEADER_MAPSIZE 0x18
#define NSRT_HEADER_VERSION 22                  // version 2.2 header
#define DETECT_SMC_COM_FUCKED_UP_LOROM 1        // adds support for interleaved LoROMs

    {"ns", NULL, "force ROM is not split"},
#endif
    {"int", NULL, "force ROM is in interleaved format"},
    {"int2", NULL, "force ROM is in interleaved format 2"},
    {"nint", NULL, "force ROM is not in interleaved format"},
    {"bs", NULL, "force ROM is a Broadcast Satellaview dump"},
    {"nbs", NULL, "force ROM is a regular cartridge dump"},
    {"n", "NEW_NAME", "change internal ROM name to NEW_NAME"},
    {"smc", NULL, "convert to Super Magicom/SMC"},
    {"fig", NULL, "convert to *Pro Fighter*/(all)FIG"},
    {"figs", NULL, "convert Snes9x/ZSNES *.srm (SRAM) to *Pro Fighter*/(all)FIG"},
    {"swc", NULL, "convert to Super Wild Card*/(all)SWC"},
    {"swcs", NULL, "convert Snes9x/ZSNES *.srm (SRAM) to Super Wild Card*/(all)SWC"},
    {"mgd", NULL, "convert to Multi Game*/MGD2/MGH/RAW"},
    {"gd3", NULL, "convert to Professor SF(2) Game Doctor SF3/6/7"},
    {"ufos", NULL, "convert Snes9x/ZSNES *.srm (SRAM) to Super UFO"},
    {"stp", NULL, "convert SRAM from backup unit for use with an emulator\n"
               OPTION_LONG_S "stp just strips the first 512 bytes"},
    {"dbuh", NULL, "display (relevant part of) backup unit header"},
    {"dint", NULL, "convert ROM to non-interleaved format"},
    {"ctrl", "TYPE", "specify type of controller in port 1 for emu when converting\n"
                     "TYPE='0' gamepad\n"
                     "TYPE='1' mouse\n"
                     "TYPE='2' mouse / gamepad\n"
                     "TYPE='6' multitap"},
    {"ctrl2", "TYPE", "specify type of controller in port 2 for emu when converting\n"
                      "TYPE='0' gamepad\n"
                      "TYPE='1' mouse\n"
                      "TYPE='2' mouse / gamepad\n"
                      "TYPE='3' super scope\n"
                      "TYPE='4' super scope / gamepad\n"
                      "TYPE='5' Konami's justifier\n"
                      "TYPE='6' multitap\n"
                      "TYPE='7' mouse / super scope / gamepad"},
    {"col", "0xCOLOR", "convert 0xRRGGBB (html) <-> 0xXXXX (SNES)\n"
                       "this routine was used to find green colors in games and\n"
                       "to replace them with red colors (blood mode)"},
#if 0
//TODO
    {"sx", "convert to Snes9X (emulator)/S9X save state; " OPTION_LONG_S "rom=SAVESTATE"},
    {"zs", "convert to ZSNES (emulator) save state; " OPTION_LONG_S "rom=SAVESTATE"},
    {"xzs", "extract GFX from ZSNES (emulator) save state; " OPTION_LONG_S "rom=SAVESTATE"},
    {"spc", "convert SPC sound to WAV; " OPTION_LONG_S "rom=SPCFILE"},
#endif
    {"j", NULL, "join split ROM"},
    {"s", NULL, "split ROM into 8 Mb parts (for backup unit(s) with fdd)"},
    {"ssize", "SIZE", "specify split part size in Mbit (not for Game Doctor SF3)"},
#if 0
    {"p", NULL, "pad ROM to full Mb"},
#endif
    {"k", NULL, "remove protection (crack)"},
    {"f", NULL, "remove NTSC/PAL protection"},
    {"l", NULL, "remove SlowROM checks"},
    {"chk", NULL, "fix ROM checksum"},
    {NULL, NULL, NULL}
  };

typedef struct st_snes_header
{
  unsigned char maker_high;                     // 0
  unsigned char maker_low;                      // 1
  unsigned char game_id_prefix;                 // 2
  unsigned char game_id_low;                    // 3
  unsigned char game_id_high;                   // 4
  unsigned char game_id_country;                // 5
  // 'E' = USA, 'F' = France, 'G' = Germany, 'J' = Japan, 'P' = Europe, 'S' = Spain
  unsigned char pad[10];                        // 6
  unsigned char name[SNES_NAME_LEN];            // 16
  unsigned char map_type;                       // 37, a.k.a. ROM makeup
  unsigned char rom_type;                       // 38
#define bs_month rom_type                       // release date, month
  unsigned char rom_size;                       // 39
#define bs_day rom_size                         // release date, day
  unsigned char sram_size;                      // 40
#define bs_map_type sram_size
  unsigned char country;                        // 41
#define bs_type country
  unsigned char maker;                          // 42
  unsigned char version;                        // 43
  /*
    If we combine the following 4 bytes in 2 short int variables,
    inverse_checksum and checksum, they will have an incorrect value on big
    endian machines.
  */
  unsigned char inverse_checksum_low;           // 44
  unsigned char inverse_checksum_high;          // 45
  unsigned char checksum_low;                   // 46
  unsigned char checksum_high;                  // 47
} st_snes_header_t;

static st_snes_header_t snes_header;
static int snes_split, snes_sramsize, snes_header_base, snes_hirom,
           snes_hirom_ok, nsrt_header, force_interleaved, bs_dump, st_dump;
static snes_file_t type;

static unsigned char gd3_hirom_8mb_map[GD3_HEADER_MAPSIZE] = {
  0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
  0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
  0x22, 0x22, 0x22, 0x22, 0x22, 0x22, 0x22, 0x22
};
static unsigned char gd3_hirom_16mb_map[GD3_HEADER_MAPSIZE] = {
  0x20, 0x21, 0x20, 0x21, 0x20, 0x21, 0x20, 0x21,
  0x20, 0x21, 0x20, 0x21, 0x20, 0x21, 0x20, 0x21,
  0x22, 0x23, 0x22, 0x23, 0x22, 0x23, 0x22, 0x23
};
static unsigned char gd3_hirom_24mb_map[GD3_HEADER_MAPSIZE] = {
  0x20, 0x21, 0x22, 0x00, 0x20, 0x21, 0x22, 0x00,
  0x20, 0x21, 0x22, 0x00, 0x20, 0x21, 0x22, 0x00,
  0x24, 0x25, 0x23, 0x00, 0x24, 0x25, 0x23, 0x00
};
static unsigned char gd3_hirom_32mb_map[GD3_HEADER_MAPSIZE] = {
