/*
snes.c - Super Nintendo support for uCON64

written by 1999 - 2002 NoisyB (noisyb@gmx.net)
           2001 - 2002 dbjh
                  2002 John Weidman


This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 2 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program; if not, write to the Free Software
Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
*/
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include "config.h"
#include "misc.h"
#include "quick_io.h"
#include "ucon64.h"
#include "ucon64_db.h"
#include "ucon64_misc.h"
#include "snes.h"
#include "backup/smc.h"
#include "backup/mgd.h"
#include "backup/swc.h"
#include "backup/fig.h"


#define SNES_HEADER_START 32688
#define SNES_HEADER_LEN (sizeof (st_snes_header_t))
#define SNES_HIROM 32768
#define SNES_NAME_LEN 21
#define ALT_HILO                                // use Snes9x' Hi/LoROM detection method
#define GD3_HEADER_MAPSIZE 0x18


static int snes_chksum (st_rominfo_t *rominfo, unsigned char *rom_buffer);

    "  " OPTION_LONG_S "smc         convert to Super Magicom/SMC\n"
    "  " OPTION_LONG_S "fig         convert to *Pro Fighter*/(all)FIG\n"
    "  " OPTION_LONG_S "figs        convert Snes9x/ZSNES *.srm (SRAM) to *Pro Fighter*/(all)FIG;\n"
    "                  " OPTION_LONG_S "rom=SRAM\n"
    "  " OPTION_LONG_S "swc         convert to Super Wild Card*/(all)SWC\n"
    "  " OPTION_LONG_S "swcs        convert Snes9x/ZSNES *.srm (SRAM) to Super Wild Card*/(all)SWC;\n"
    "                  " OPTION_LONG_S "rom=SRAM\n"
    "  " OPTION_LONG_S "mgd         convert to Multi Game*/MGD2/MGH/RAW\n"
    "  " OPTION_LONG_S "gd3         convert to Professor SF(2) Game Doctor SF3/6/7\n"
    "  " OPTION_LONG_S "ufos        convert Snes9x/ZSNES *.srm (SRAM) to Super UFO; " OPTION_LONG_S "rom=SRAM\n"
    "  " OPTION_LONG_S "stp         convert SRAM from backup unit for use with an Emulator\n"
    "                  " OPTION_LONG_S "stp just strips the first 512 bytes\n"
#if 0
    "  " OPTION_LONG_S "gdf         fix Professor SF(2) Game Doctor SF3/6/7 savegame problems\n"
#endif
    "  " OPTION_LONG_S "dint        convert ROM to non-interleaved format\n"
    "  " OPTION_LONG_S "ctrl=TYPE   specify type of controller in port 1 for emu when converting\n"
    "                  TYPE='0' gamepad\n"
    "                  TYPE='1' mouse\n"
    "                  TYPE='2' mouse / gamepad\n"
    "                  TYPE='3' super scope\n"
    "                  TYPE='4' super scope / gamepad\n"
    "                  TYPE='5' Konami's justifier\n"
    "                  TYPE='6' multitap\n"
    "                  TYPE='7' mouse / super scope / gamepad\n"
    "  " OPTION_LONG_S "ctrl2=TYPE  specify type of controller in port 2 for emu when converting\n"
    "                  TYPE may be any value that is valid for " OPTION_LONG_S "ctrl\n"
    "  " OPTION_LONG_S "col         convert 0xRRGGBB (html) <-> 0xXXXX (snes); " OPTION_LONG_S "rom=0xCOLOR\n"
    "                  this routine was used to find green colors in games and\n"
    "                  to replace them with red colors (blood mode)\n"
#if 0
    "TODO:  " OPTION_LONG_S "sx     convert to Snes9X (Emulator)/S9X save state; " OPTION_LONG_S "rom=SAVESTATE\n"
    "TODO:  " OPTION_LONG_S "zs     convert to ZSNES (Emulator) save state; " OPTION_LONG_S "rom=SAVESTATE\n"
    "TODO:  " OPTION_LONG_S "xzs    extract GFX from ZSNES (Emulator) save state; " OPTION_LONG_S "rom=SAVESTATE\n"
    "TODO:  " OPTION_LONG_S "spc    convert SPC sound to WAV; " OPTION_LONG_S "rom=SPCFILE\n"
#endif
    "  " OPTION_S "j           join split ROM\n"
    "  " OPTION_S "s           split ROM into 4 Mb parts (for backup unit(s) with fdd)\n"
#if 0
    "  " OPTION_S "p           pad ROM to full Mb\n"
#endif
    "  " OPTION_S "k           remove protection (crack)\n"
    "  " OPTION_S "f           remove NTSC/PAL protection\n"
    "  " OPTION_S "l           convert to SlowROM\n"
    "  " OPTION_LONG_S "chk         fix ROM checksum\n"
    ,
    NULL
  };

typedef struct st_snes_header
{
  unsigned char maker_x;                        // 0
  unsigned char maker_y;                        // 1
  unsigned char pad[14];                        // 2
  unsigned char name[SNES_NAME_LEN];            // 16
#if     SNES_NAME_LEN != 21
#error  Adjust st_snes_header.pad to make st_snes_header 48 bytes in size
#endif
  unsigned char map_type;                       // 37, AKA ROM makeup
  unsigned char rom_type;                       // 38
#define bs_month rom_type
  unsigned char size;                           // 39
  unsigned char sram_size;                      // 40
#define bs_makeup sram_size
  unsigned char country;                        // 41
#define bs_size country
  unsigned char maker;                          // 42
  unsigned char version;                        // 43
  /*
    If we combine the following 4 bytes in 2 short int variables,
    inverse_checksum and checksum, they will have an incorrect value on big
    endian machines.
  */
  unsigned char inverse_checksum_low;           // 44
  unsigned char inverse_checksum_high;          // 45
  unsigned char checksum_low;                   // 46
  unsigned char checksum_high;                  // 47
} st_snes_header_t;

st_snes_header_t snes_header;

static int snes_split, force_interleaved, bs_dump, rom_is_top,  // flag for interleaved ROM dump
           snes_sramsize, snes_hirom, snes_hirom_changed;       //  of "Tales of Phantasia"
/*
  The flag `snes_hirom_changed' is necessary for ROMs that are in the normal
  interleaved format (type 1). The variable `snes_hirom' changes the first time
  when snes_deinterleave() is called from snes_chksum(). However, it should not
  change a second time. Without this flag it would change a second time when
  called from snes_dint().
*/

enum { SWC, GD3, FIG, MGD, SMC } type;

static unsigned char gd3_hirom_8mb_map[GD3_HEADER_MAPSIZE] = {
  0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
  0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
  0x22, 0x22, 0x22, 0x22, 0x22, 0x22, 0x22, 0x22
};
static unsigned char gd3_hirom_16mb_map[GD3_HEADER_MAPSIZE] = {
