/*
snes.c - Super NES support for uCON64

Copyright (c) 1999 - 2002              NoisyB
Copyright (c) 2001 - 2005, 2015 - 2019 dbjh
Copyright (c) 2002 - 2003              John Weidman
Copyright (c) 2004                     JohnDie


This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 2 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program; if not, write to the Free Software
Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
*/
#ifdef  HAVE_CONFIG_H
#include "config.h"
#endif
#ifdef  _MSC_VER
#pragma warning(push)
#pragma warning(disable: 4668) // 'symbol' is not defined as a preprocessor macro, replacing with '0' for 'directives'
#endif
#include <ctype.h>
#ifdef  _MSC_VER
#pragma warning(pop)
#endif
#include <stdlib.h>
#ifdef  HAVE_UNISTD_H
#include <unistd.h>
#endif
#ifdef  _MSC_VER
#pragma warning(push)
#pragma warning(disable: 4820) // 'bytes' bytes padding added after construct 'member_name'
#endif
#include <sys/stat.h>
#ifdef  _MSC_VER
#pragma warning(pop)
#endif
#include "misc/archive.h"
#include "misc/bswap.h"

      "TYPE" OPTARG_S "6 multitap",
      &snes_obj[0]
    },
    {
      "ctrl2", 1, 0, UCON64_CTRL2,
      "TYPE", "specify type of controller in port 2 for emu when converting\n"
      "TYPE" OPTARG_S "0 gamepad\n"
      "TYPE" OPTARG_S "1 mouse\n"
      "TYPE" OPTARG_S "2 mouse / gamepad\n"
      "TYPE" OPTARG_S "3 super scope\n"
      "TYPE" OPTARG_S "4 super scope / gamepad\n"
      "TYPE" OPTARG_S "5 Konami's justifier\n"
      "TYPE" OPTARG_S "6 multitap\n"
      "TYPE" OPTARG_S "7 mouse / super scope / gamepad",
      &snes_obj[6]
    },
    {
      "stp", 0, 0, UCON64_STP,
      NULL, "convert SRAM from backup unit for use with an emulator\n"
      OPTION_LONG_S "stp just strips the first 512 bytes",
      NULL
    },
    {
      "dbuh", 0, 0, UCON64_DBUH,
      NULL, "display (relevant part of) backup unit header and interpret it",
      &snes_obj[7]
    },
    {
      "dint", 0, 0, UCON64_DINT,
      NULL, "deinterleave ROM (regardless whether the ROM is interleaved)",
      &snes_obj[5]
    },
    {
      "col", 1, 0, UCON64_COL,
      "0xCOLOR", "convert 0xRRGGBB (HTML) <-> 0xXXXX (SNES)"
      /*"this routine was used to find green colors in games and\n"
      "to replace them with red colors (blood mode)"*/,
      &snes_obj[9]
    },
    {
      "j", 0, 0, UCON64_J,
      NULL, "join split ROM",
      &snes_obj[3]
    },
    {
      "s", 0, 0, UCON64_S,
      NULL, "split ROM (not for UFO Pro 8 SD); default part size is 8 Mb",
      &snes_obj[2]
    },
    {
      "smgh", 0, 0, UCON64_SMGH,
      NULL, "split ROM for Multi Game Hunter/MGH",
      &snes_obj[2]
    },
    {
      "ssize", 1, 0, UCON64_SSIZE,
      "SIZE", "specify split part size in Mbit (not for Game Doctor SF3)",
      &snes_obj[0]
    },
#if 0
    {
      "p", 0, 0, UCON64_P,
      NULL, "pad ROM to full Mb",
      &snes_obj[1]
    },
#endif
    {
      "k", 0, 0, UCON64_K,
      NULL, "remove protection (crack)",
      &snes_obj[7]
    },
    {
      "f", 0, 0, UCON64_F,
      NULL, "remove NTSC/PAL protection",
      &snes_obj[1]
    },
    {
      "l", 0, 0, UCON64_L,
      NULL, "remove SlowROM checks",
      &snes_obj[7]
    },
    {
      "chk", 0, 0, UCON64_CHK,
      NULL, "fix ROM checksum",
      &snes_obj[1]
    },
    {
      "multi", 1, 0, UCON64_MULTI,
      "SIZE", "make multi-game file for use with Super Flash flash card,\n"
      "truncated to SIZE Mbit; file with loader must be specified\n"
      "first, then all the ROMs, multi-game file to create last",
      &snes_obj[4]
    },
    {
      "dmirr", 0, 0, UCON64_DMIRR,
      NULL, "\"de-mirror\" ROM (strip mirrored block from end of ROM)",
      &snes_obj[7]
    },
    {
      "dnsrt", 0, 0, UCON64_DNSRT,
      NULL, "\"de-NSRT\" ROM (restore name and checksum from NSRT header)",
      &snes_obj[7]
    },
    {
      "mksrm", 0, 0, UCON64_MKSRM,
      NULL, "create *.srm (SRAM) file with size based on ROM information",
      &snes_obj[8]
    },
    {NULL, 0, 0, 0, NULL, NULL, NULL}
  };

typedef struct st_snes_header
{
  unsigned char maker_high;                     // 0
  unsigned char maker_low;                      // 1
  unsigned char game_id_prefix;                 // 2
  unsigned char game_id_low;                    // 3
  unsigned char game_id_high;                   // 4
  unsigned char game_id_country;                // 5
  // 'E' = USA, 'F' = France, 'G' = Germany, 'J' = Japan, 'P' = Europe, 'S' = Spain
  unsigned char pad1[7];                        // 6
  unsigned char sfx_sram_size;                  // 13
  unsigned char pad2[2];                        // 14
  unsigned char name[SNES_NAME_LEN];            // 16
  unsigned char map_type;                       // 37, a.k.a. ROM makeup
#ifdef  _MSC_VER
#pragma warning(push)
#pragma warning(disable: 4201) // nonstandard extension used : nameless struct/union
#endif
  union
  {
    unsigned char rom_type;                     // 38
    unsigned char bs_month;                     // release date, month
  };
  union
  {
    unsigned char rom_size;                     // 39
    unsigned char bs_day;                       // release date, day
  };
  union
  {
    unsigned char sram_size;                    // 40
    unsigned char bs_map_type;
  };
  union
  {
    unsigned char country;                      // 41
    unsigned char bs_type;
  };
#ifdef  _MSC_VER
#pragma warning(pop)
#endif
  unsigned char maker;                          // 42
  unsigned char version;                        // 43
  /*
    If we combine the following 4 bytes in 2 short int variables,
    inverse_checksum and checksum, they will have an incorrect value on big
    endian machines.
  */
  unsigned char inverse_checksum_low;           // 44
  unsigned char inverse_checksum_high;          // 45
  unsigned char checksum_low;                   // 46
  unsigned char checksum_high;                  // 47
} st_snes_header_t;

typedef struct st_split_info
{
  int nparts;
  struct st_part
  {
    char *fname;
    size_t size;
  } parts[2];
} st_split_info_t;

typedef struct st_ustar_header
{
  char name[100];
  char file_mode[8];
  char uid[8];
  char gid[8];
  char file_size[12];
  char mtime[12];
  char header_checksum[8];
  char file_type;
  char link_name[100];
  char magic[8];
  char uname[32];
  char gname[32];
  char dev_major[8];
  char dev_minor[8];
  char name_prefix[155];
  char pad[12];
} st_ustar_header_t;

static st_snes_header_t snes_header;
static int snes_sram_size, snes_sfx_sram_size, snes_header_base, snes_hirom,
           snes_hirom_ok, nsrt_header, bs_dump, st_dump;
static snes_copier_t copier_type;
static st_split_info_t split_info = { 0, { { 0, 0 }, { 0, 0 } } };

static unsigned char gd3_hirom_8mb_map[GD3_HEADER_MAPSIZE] =
  {
    0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
